# Exploring and Answering 21 Questions of City of SF Employee Salary Data using Pandas

## Data and questions provided by PRIYANG-BHATT

In [39]:
import pandas as pd

url = 'https://raw.githubusercontent.com/PRIYANG-BHATT/Datasets-Youtube-Pandas/main/DS/Salaries.csv'
data = pd.read_csv(url,index_col=0)

## Question 1: Display the first 10 rows of the dataset

In [40]:
data.head(10)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

## Question 2: Display the bottom 10 rows of the dataset

In [41]:
data.tail(10)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148646,Carolyn A Wilson,Human Services Technician,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148647,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148648,Joann Anderson,Communications Dispatcher 2,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148649,Leon Walker,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

## Question 3: What is the shape of the data? (rows x columns)

In [42]:
data.shape

(148654, 12)

In [43]:
#alternatively, you can use an index to be more specific
print("Number of rows:",data.shape[0])
print("Number of columns:",data.shape[1])

Number of rows: 148654
Number of columns: 12

## Question 4: What are the total number of columns and what are their datatypes? What is their total memory requirement?

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148654 entries, 1 to 148654
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148654 non-null  object
 1   JobTitle          148654 non-null  object
 2   BasePay           148045 non-null  float64
 3   OvertimePay       148650 non-null  float64
 4   OtherPay          148650 non-null  float64
 5   Benefits          112491 non-null  float64
 6   TotalPay          148654 non-null  float64
 7   TotalPayBenefits  148654 non-null  float64
 8   Year              148654 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 15.4+ MB

## Question 5: Return NULL values in the data set

In [35]:
    data.isnull().sum() #this returns the count of null values per field

EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

## Question 6: How to drop the fields Notes, Agency, and Status?

In [37]:
data.columns #check exact column names

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [46]:
data = data.drop(['Notes', 'Agency', 'Status'], axis=1) #drop specified columns. axis = 0 drops rows, axis = 1 drops col

In [49]:
data.head(1) #notes, agency, status are dropped

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
Id,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011

## Question 7: What are the overall statistics of the dataset?

In [52]:
data.describe(include='all') # include='all' gives catagorical top

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000
unique,110811,2159,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,13,7036,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643
std,NaN,NaN,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538
min,NaN,NaN,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000
max,NaN,NaN,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000

## Question 8: What are the top 5 most common names?

In [53]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [57]:
data['EmployeeName'].value_counts().head() 
#value_counts() will display all values in desc order. adding .head() at the end will give top 5

Kevin Lee       13
Steven Lee      11
William Wong    11
Richard Lee     11
Michael Wong     9
Name: EmployeeName, dtype: int64

## Question 9: What is the number of unique job titles?

In [58]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [59]:
data['JobTitle'].nunique()

2159

## Question 10: How many job titles contain the word 'captain'?

In [60]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [61]:
data['JobTitle']

Id
1         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
2                        CAPTAIN III (POLICE DEPARTMENT)
3                        CAPTAIN III (POLICE DEPARTMENT)
4                   WIRE ROPE CABLE MAINTENANCE MECHANIC
5           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148650                                         Custodian
148651                                      Not provided
148652                                      Not provided
148653                                      Not provided
148654                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [68]:
len(data[data['JobTitle'].str.contains('CAPTAIN', case=False)]) 
#option 1, use len to count instances. str.contains() defaults to case sensitive, so I add case=False to make it case insensitive

552

In [70]:
data[data['JobTitle'].str.contains('CAPTAIN', case=False)].count()
#option 2, using count() on the dataframe which counts per Field

EmployeeName        552
JobTitle            552
BasePay             551
OvertimePay         552
OtherPay            552
Benefits            411
TotalPay            552
TotalPayBenefits    552
Year                552
dtype: int64

## Question 11: Display all names from the Fire Dept.

In [71]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [76]:
data[data['JobTitle'].str.contains('FIRE DEPARTMENT',case=False)]
#same concept as above

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
Id,,,,,,,,,
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011
7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011
9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011
10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011
11,ARTHUR KENNEY,"ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",194999.39,71344.88,33149.90,NaN,299494.17,299494.17,2011
...,...,...,...,...,...,...,...,...,...
32624,JAMES BARDEN,"BATTALION CHIEF, (FIRE DEPARTMENT)",0.00,1290.69,5802.68,NaN,7093.37,7093.37,2011
36163,Joanne Hayes-White,"Chief, Fire Department",296943.01,0.00,17816.59,72047.88,314759.60,386807.48,2012
72927,Joanne M Hayes-White,"Chief, Fire Department",313686.01,0.00,23236.00,85431.39,336922.01,422353.40,2013
102304,Robert E Evans,"Captain, (Fire Department)",NaN,0.00,35332.78,0.00,35332.78,35332.78,2013
110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014

In [77]:
data[data['JobTitle'].str.contains('FIRE DEPARTMENT',case=False)]['EmployeeName']
#I add one more column ref. at the end to display only EmployeeName

Id
5              PATRICK GARDNER
7                    ALSON LEE
9               MICHAEL MORRIS
10          JOANNE HAYES-WHITE
11               ARTHUR KENNEY
                  ...
32624             JAMES BARDEN
36163       Joanne Hayes-White
72927     Joanne M Hayes-White
102304          Robert E Evans
110536    Joanne M Hayes-White
Name: EmployeeName, Length: 226, dtype: object

## Question 12: What are the min, max, and avg BasePay?

In [78]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [79]:
data['BasePay'].describe()

count    148045.000000
mean      66325.448841
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

## Question 13: Replace 'Not Provided' in EmployeeName with NaN

In [80]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [86]:
data['EmployeeName']

#you can see id 148651 - 148653 have a value 'Not provided'

Id
1            NATHANIEL FORD
2              GARY JIMENEZ
3            ALBERT PARDINI
4         CHRISTOPHER CHONG
5           PATRICK GARDNER
                ...
148650        Roy I Tillery
148651                  NaN
148652                  NaN
148653                  NaN
148654            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [83]:
import numpy as np
data['EmployeeName'].replace('Not provided',np.nan)

#numpy package used for nan

Id
1            NATHANIEL FORD
2              GARY JIMENEZ
3            ALBERT PARDINI
4         CHRISTOPHER CHONG
5           PATRICK GARDNER
                ...
148650        Roy I Tillery
148651                  NaN
148652                  NaN
148653                  NaN
148654            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [84]:
import numpy as np
data['EmployeeName'] = data['EmployeeName'].replace('Not provided',np.nan)

#need to assign the EmployeeName column to the above statement to make the data replacement permananent

In [85]:
data['EmployeeName']

Id
1            NATHANIEL FORD
2              GARY JIMENEZ
3            ALBERT PARDINI
4         CHRISTOPHER CHONG
5           PATRICK GARDNER
                ...
148650        Roy I Tillery
148651                  NaN
148652                  NaN
148653                  NaN
148654            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

## Question 14: Drop the rows that have 5 missing values

In [90]:
data.isnull().sum()

#this shows the number of rows missing a value per column

EmployeeName            4
JobTitle                0
BasePay               609
OvertimePay             4
OtherPay                4
Benefits            36163
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [92]:
data.isnull().sum(axis=1)

#this shows the number of values(columns) missing per row. axis=1 indicates columns

Id
1         1
2         1
3         1
4         1
5         1
         ..
148650    0
148651    5
148652    5
148653    5
148654    0
Length: 148654, dtype: int64

In [102]:
data.isnull().sum(axis=1)==5

#this shows a bool if the row has 5 missing values or not

Id
1         False
2         False
3         False
4         False
5         False
          ...
148650    False
148651     True
148652     True
148653     True
148654    False
Length: 148654, dtype: bool

In [98]:
data.drop(data[data.isnull().sum(axis=1)==5].index,axis=0)

#add drop command with axis=0 to indicate rows

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
Id,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011
4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.0,0.00,0.00,2014
148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.0,0.00,0.00,2014
148649,Leon Walker,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014
148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014
148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014

In [103]:
data.drop(data[data.isnull().sum(axis=1)==5].index,axis=0,inplace=True)

#inplace=True makes this permanent

In [104]:
data.isnull().sum(axis=1)

Id
1         1
2         1
3         1
4         1
5         1
         ..
148646    0
148648    0
148649    0
148650    0
148654    0
Length: 148650, dtype: int64

## Question 15: What is the job title of Albert Pardini?

In [105]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [109]:
data[data['EmployeeName']=='Albert Pardini']['JobTitle']

Id
36520    Captain 3
Name: JobTitle, dtype: object

## Question 16: How much does Albert Pardini make? Including Benefits

In [110]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [112]:
data[data['EmployeeName'] == 'Albert Pardini']

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
Id,,,,,,,,,
36520,Albert Pardini,Captain 3,196265.04,0.0,11404.04,46326.21,207669.08,253995.29,2012

In [113]:
data[data['EmployeeName'] == 'Albert Pardini']['TotalPayBenefits']

Id
36520    253995.29
Name: TotalPayBenefits, dtype: float64

## Question 17: What is the name of the employee with the highest basepay?

In [114]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [115]:
data['BasePay'].max() # find max value of BasePay

319275.01

In [117]:
data[data['BasePay'].max()==data['BasePay']]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
Id,,,,,,,,,
72926,Gregory P Suhr,Chief of Police,319275.01,0.0,20007.06,86533.21,339282.07,425815.28,2013

In [118]:
data[data['BasePay'].max()==data['BasePay']]['EmployeeName']

Id
72926    Gregory P Suhr
Name: EmployeeName, dtype: object

## Question 18: What is the average BasePay among all employees per Year?

In [122]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [123]:
data.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

## Question 19: What is the average BasePay of all employees per JobTitle?

In [124]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [125]:
data.groupby('JobTitle').mean()['BasePay']

JobTitle
ACCOUNT CLERK                                     43300.806506
ACCOUNTANT                                        46643.172000
ACCOUNTANT INTERN                                 28732.663958
ACPO,JuvP, Juv Prob (SFERS)                       62290.780000
ACUPUNCTURIST                                     66374.400000
                                                      ...
X-RAY LABORATORY AIDE                             47664.773077
X-Ray Laboratory Aide                             46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.910000
Youth Comm Advisor                                39077.957500
ZOO CURATOR                                       43148.000000
Name: BasePay, Length: 2158, dtype: float64

## Question 20: What is the average BasePay of Accountants?

In [126]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [129]:
data[data['JobTitle']=='ACCOUNTANT']

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
Id,,,,,,,,,
19264,CARLITO NEPACENA,ACCOUNTANT,65392.01,0.0,0.00,NaN,65392.01,65392.01,2011
19325,ROSALINDA TAN,ACCOUNTANT,65225.31,0.0,0.00,NaN,65225.31,65225.31,2011
20993,NELSON ALVARADO,ACCOUNTANT,60076.24,0.0,0.00,NaN,60076.24,60076.24,2011
25928,JEANETTE COOPER,ACCOUNTANT,42522.30,0.0,2782.08,NaN,45304.38,45304.38,2011
35286,CESAR PALARCA,ACCOUNTANT,0.00,0.0,1148.40,NaN,1148.40,1148.40,2011

In [131]:
data[data['JobTitle']=='ACCOUNTANT'].mean()['BasePay']

46643.172

## Question 21: What are the Top 5 most common jobs?

In [132]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [133]:
data['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64